In [1]:
import numpy as np
import pandas as pd
import datetime as dt
import os

In [3]:
names_df = pd.DataFrame(columns = ["name", "sex", "count", "year"])
names_df

Empty DataFrame
Columns: [name, sex, count, year]
Index: []

In [6]:
for fileName in os.listdir("Resources/names"):
    if fileName.endswith(".txt"):
        temp_df=pd.read_csv("Resources/names/"+ fileName, sep=",", header=None)
        temp_df.columns = ["name", "sex", "count"]
        temp_df["year"] = int(fileName.split("yob")[1].split(".txt")[0])
        names_df = names_df.append(temp_df)
names_df.head()

        name sex count  year
0       Mary   F  7065  1880
1       Anna   F  2604  1880
2       Emma   F  2003  1880
3  Elizabeth   F  1939  1880
4     Minnie   F  1746  1880

In [7]:
names_df.describe()

           name      sex    count     year
count   3914092  3914092  3914092  3914092
unique    98400        2    13720      139
top     William        F        5     2008
freq        556  2313054   545942    70158

In [8]:
names_df['count'] = names_df['count'].astype(int)
names_df['year'] = names_df['year'].astype(int)
names_df.dtypes

name     object
sex      object
count     int32
year      int32
dtype: object

In [9]:
print(names_df.isnull().values.any())

False

In [10]:
names_df.to_csv('Resources/nat_names.csv', index=False)

In [11]:
state_names_df = pd.DataFrame(columns = ["state","sex","year","name", "count"])
state_names_df

Empty DataFrame
Columns: [state, sex, year, name, count]
Index: []

In [12]:
for fileName in os.listdir("Resources/namesbystate"):
    if fileName.endswith(".TXT"):
        tempdf=pd.read_csv("Resources/namesbystate/"+ fileName, sep=",", header=None)
        tempdf.columns = ["state","sex","year","name", "count"]
        state_names_df = state_names_df.append(tempdf)
state_names_df.head()

  state sex  year      name count
0    AK   F  1910      Mary    14
1    AK   F  1910     Annie    12
2    AK   F  1910      Anna    10
3    AK   F  1910  Margaret     8
4    AK   F  1910     Helen     7

In [13]:
state_names_df.describe()

          state      sex     year     name    count
count   6028151  6028151  6028151  6028151  6028151
unique       51        2      109    31595     4929
top          CA        F     2016   Leslie        5
freq     381214  3359619    95261     7320   772706

In [14]:
state_names_df['count'] = state_names_df['count'].astype(int)
state_names_df['year'] = state_names_df['year'].astype(int)
state_names_df.dtypes

state    object
sex      object
year      int32
name     object
count     int32
dtype: object

In [15]:
print(state_names_df.isnull().values.any())

False

In [16]:
state_names_df.to_csv('Resources/state_names.csv', index=False)

In [17]:
import sqlalchemy
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func